<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2203928e5dfb0e5a32f5039db3980a5be11d6fe166e3d5bdf6a4be679fa75f76","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1238 at https://github.com/cal-itp/data-infra/actions/runs/20580784636","plan_out_hash":"919a9cf65d53e4ec37f785346a71709f252b4b8ebc3a6835b8c20de7f72b8678","plan_hash":"e10418368e31277a653bcffc66ddbfc1182c5b54b23d642bea7a9c3e2565f2c3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "YupoWA==" -> (known after apply)
!~      detect_md5hash      = "k8gtTf8qMllxMyvmMti80Q==" -> "different hash"
!~      generation          = 1763432903382049 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "k8gtTf8qMllxMyvmMti80Q==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "/SQyEw==" -> (known after apply)
!~      detect_md5hash      = "PS6O2bAmQG8Pmb24efxDgA==" -> "different hash"
!~      generation          = 1763432903392720 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "PS6O2bAmQG8Pmb24efxDgA==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1238](https://github.com/cal-itp/data-infra/actions/runs/20580784636)